#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.redirect_lambda.data.archive_file.lambda: Reading...
module.create_short_url_lambda.data.archive_file.lambda: Reading...
module.delete_lambda.data.archive_file.lambda: Reading...
module.redirect_lambda.data.archive_file.lambda: Read complete after 0s [id=33cd2b3d2308c928d474dc204dc655e53db5f0e1]
module.create_short_url_lambda.data.archive_file.lambda: Read complete after 0s [id=33cd2b3d2308c928d474dc204dc655e53db5f0e1]
module.delete_lambda.data.archive_file.lambda: Read complete after 0s [id=33cd2b3d2308c928d474dc204dc655e53db5f0e1]
module.create_short_url_lambda.data.aws_iam_policy_document.assume_role: Reading...
module.delete_lambda.data.aws_iam_policy_document.assume_role: Reading...
module.redirect_lambda.data.aws_iam_policy_document.assume_role: Reading...
aws_api_gateway_rest_api.url_shortener_api: Refreshing state... [id=ktqo0w8q1j]
module.create_short_url_lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.delete_lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
aws_dynamodb_table.urls: Refreshing state... [id=urls]
module.redirect_lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
data.aws_iam_policy_document.create_short_url_lambda: Reading...
data.aws_iam_policy_document.allow_get_url_lambda: Reading...
data.aws_iam_policy_document.allow_delete_url_lambda: Reading...
data.aws_iam_policy_document.allow_get_url_lambda: Read complete after 0s [id=2816463254]
data.aws_iam_policy_document.create_short_url_lambda: Read complete after 0s [id=2348542042]
data.aws_iam_policy_document.allow_delete_url_lambda: Read complete after 0s [id=3620161757]
module.delete_lambda.data.aws_iam_policy_document.policies: Reading...
module.redirect_lambda.data.aws_iam_policy_document.policies: Reading...
module.create_short_url_lambda.data.aws_iam_policy_document.policies: Reading...
module.delete_lambda.data.aws_iam_policy_document.policies: Read complete after 0s [id=4168244811]
module.create_short_url_lambda.data.aws_iam_policy_document.policies: Read complete after 0s [id=1299851198]
module.redirect_lambda.data.aws_iam_policy_document.policies: Read complete after 0s [id=4168244811]
module.delete_lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=delete-url-6d4c201-lambda-role]
module.create_short_url_lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=create-short-url-6d4c201-lambda-role]
module.redirect_lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=redirect-6d4c201-lambda-role]
aws_api_gateway_resource.redirect_resource: Refreshing state... [id=n44nx6]
module.post_url_method.aws_api_gateway_method.method: Refreshing state... [id=agm-ktqo0w8q1j-0eyhu620n6-POST]
module.delete_url_method.aws_api_gateway_method.method: Refreshing state... [id=agm-ktqo0w8q1j-0eyhu620n6-DELETE]
module.redirect_url_method.aws_api_gateway_method.method: Refreshing state... [id=agm-ktqo0w8q1j-n44nx6-GET]
module.redirect_lambda.aws_lambda_function.lambda: Refreshing state... [id=redirect-6d4c201]
module.create_short_url_lambda.aws_lambda_function.lambda: Refreshing state... [id=create-short-url-6d4c201]
module.delete_lambda.aws_lambda_function.lambda: Refreshing state... [id=delete-url-6d4c201]
module.delete_url_method.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.redirect_url_method.aws_api_gateway_integration.integration: Refreshing state... [id=agi-ktqo0w8q1j-n44nx6-GET]
module.redirect_url_method.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.delete_url_method.aws_api_gateway_integration.integration: Refreshing state... [id=agi-ktqo0w8q1j-0eyhu620n6-DELETE]
module.post_url_method.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.post_url_method.aws_api_gateway_integration.integration: Refreshing state... [id=agi-ktqo0w8q1j-0eyhu620n6-POST]
aws_api_gateway_deployment.url_shortener_api_deployment: Refreshing state... [id=0mja46]
aws_api_gateway_stage.live: Refreshing state... [id=ags-ktqo0w8q1j-live]
aws_api_gateway_usage_plan.usage: Refreshing state... [id=s6hh8t]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.create_short_url_lambda.aws_iam_role.iam_for_lambda must be replaced
+/- resource "aws_iam_role" "iam_for_lambda" {
      ~ arn                   = "arn:aws:iam::692735942459:role/create-short-url-6d4c201-lambda-role" -> (known after apply)
      ~ create_date           = "2024-05-28T16:19:52Z" -> (known after apply)
      ~ id                    = "create-short-url-6d4c201-lambda-role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "create-short-url-6d4c201-lambda-role" -> "create-short-url-e484a1a-lambda-role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA2CSSHT45UXJGRR2OA" -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.create_short_url_lambda.aws_lambda_function.lambda must be replaced
+/- resource "aws_lambda_function" "lambda" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-east-1:692735942459:function:create-short-url-6d4c201" -> (known after apply)
      ~ code_sha256                    = "slQbp92P5eqcux38WC+G18045G8xtUSaDaIDR4KrZlI=" -> (known after apply)
      ~ filename                       = "create-short-url-6d4c201_lambda_function_payload.zip" -> "create-short-url-e484a1a_lambda_function_payload.zip"
      ~ function_name                  = "create-short-url-6d4c201" -> "create-short-url-e484a1a" # forces replacement
      ~ id                             = "create-short-url-6d4c201" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:create-short-url-6d4c201/invocations" -> (known after apply)
      ~ last_modified                  = "2024-05-28T16:20:11.903+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:692735942459:function:create-short-url-6d4c201:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:create-short-url-6d4c201:$LATEST/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::692735942459:role/create-short-url-6d4c201-lambda-role" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      ~ source_code_size               = 294 -> (known after apply)
      - tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
      ~ version                        = "$LATEST" -> (known after apply)
        # (12 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/create-short-url-6d4c201" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

        # (1 unchanged block hidden)
    }

  # module.delete_lambda.aws_iam_role.iam_for_lambda must be replaced
+/- resource "aws_iam_role" "iam_for_lambda" {
      ~ arn                   = "arn:aws:iam::692735942459:role/delete-url-6d4c201-lambda-role" -> (known after apply)
      ~ create_date           = "2024-05-28T16:19:52Z" -> (known after apply)
      ~ id                    = "delete-url-6d4c201-lambda-role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "delete-url-6d4c201-lambda-role" -> "delete-url-e484a1a-lambda-role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA2CSSHT45XCEIDVRSQ" -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.delete_lambda.aws_lambda_function.lambda must be replaced
+/- resource "aws_lambda_function" "lambda" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-east-1:692735942459:function:delete-url-6d4c201" -> (known after apply)
      ~ code_sha256                    = "slQbp92P5eqcux38WC+G18045G8xtUSaDaIDR4KrZlI=" -> (known after apply)
      ~ filename                       = "delete-url-6d4c201_lambda_function_payload.zip" -> "delete-url-e484a1a_lambda_function_payload.zip"
      ~ function_name                  = "delete-url-6d4c201" -> "delete-url-e484a1a" # forces replacement
      ~ id                             = "delete-url-6d4c201" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:delete-url-6d4c201/invocations" -> (known after apply)
      ~ last_modified                  = "2024-05-28T16:20:06.254+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:692735942459:function:delete-url-6d4c201:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:delete-url-6d4c201:$LATEST/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::692735942459:role/delete-url-6d4c201-lambda-role" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      ~ source_code_size               = 294 -> (known after apply)
      - tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
      ~ version                        = "$LATEST" -> (known after apply)
        # (12 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/delete-url-6d4c201" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.delete_url_method.aws_api_gateway_integration.integration will be updated in-place
  ~ resource "aws_api_gateway_integration" "integration" {
        id                      = "agi-ktqo0w8q1j-0eyhu620n6-DELETE"
      ~ uri                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:delete-url-6d4c201/invocations" -> (known after apply)
        # (15 unchanged attributes hidden)
    }

  # module.delete_url_method.aws_lambda_permission.apigw_lambda must be replaced
-/+ resource "aws_lambda_permission" "apigw_lambda" {
      ~ function_name       = "delete-url-6d4c201" -> "delete-url-e484a1a" # forces replacement
      ~ id                  = "AllowExecutionFromAPIGateway" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.post_url_method.aws_api_gateway_integration.integration will be updated in-place
  ~ resource "aws_api_gateway_integration" "integration" {
        id                      = "agi-ktqo0w8q1j-0eyhu620n6-POST"
      ~ uri                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:create-short-url-6d4c201/invocations" -> (known after apply)
        # (15 unchanged attributes hidden)
    }

  # module.post_url_method.aws_lambda_permission.apigw_lambda must be replaced
-/+ resource "aws_lambda_permission" "apigw_lambda" {
      ~ function_name       = "create-short-url-6d4c201" -> "create-short-url-e484a1a" # forces replacement
      ~ id                  = "AllowExecutionFromAPIGateway" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.redirect_lambda.aws_iam_role.iam_for_lambda must be replaced
+/- resource "aws_iam_role" "iam_for_lambda" {
      ~ arn                   = "arn:aws:iam::692735942459:role/redirect-6d4c201-lambda-role" -> (known after apply)
      ~ create_date           = "2024-05-28T16:19:52Z" -> (known after apply)
      ~ id                    = "redirect-6d4c201-lambda-role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "redirect-6d4c201-lambda-role" -> "redirect-e484a1a-lambda-role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA2CSSHT457XUAOV6ZY" -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.redirect_lambda.aws_lambda_function.lambda must be replaced
+/- resource "aws_lambda_function" "lambda" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-east-1:692735942459:function:redirect-6d4c201" -> (known after apply)
      ~ code_sha256                    = "slQbp92P5eqcux38WC+G18045G8xtUSaDaIDR4KrZlI=" -> (known after apply)
      ~ filename                       = "redirect-6d4c201_lambda_function_payload.zip" -> "redirect-e484a1a_lambda_function_payload.zip"
      ~ function_name                  = "redirect-6d4c201" -> "redirect-e484a1a" # forces replacement
      ~ id                             = "redirect-6d4c201" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:redirect-6d4c201/invocations" -> (known after apply)
      ~ last_modified                  = "2024-05-28T16:20:17.449+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:692735942459:function:redirect-6d4c201:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:redirect-6d4c201:$LATEST/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::692735942459:role/redirect-6d4c201-lambda-role" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      ~ source_code_size               = 294 -> (known after apply)
      - tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
      ~ version                        = "$LATEST" -> (known after apply)
        # (12 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/redirect-6d4c201" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.redirect_url_method.aws_api_gateway_integration.integration will be updated in-place
  ~ resource "aws_api_gateway_integration" "integration" {
        id                      = "agi-ktqo0w8q1j-n44nx6-GET"
      ~ uri                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:redirect-6d4c201/invocations" -> (known after apply)
        # (15 unchanged attributes hidden)
    }

  # module.redirect_url_method.aws_lambda_permission.apigw_lambda must be replaced
-/+ resource "aws_lambda_permission" "apigw_lambda" {
      ~ function_name       = "redirect-6d4c201" -> "redirect-e484a1a" # forces replacement
      ~ id                  = "AllowExecutionFromAPIGateway" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 9 to add, 3 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @EsmerlinJM, Action: `pull_request`*